PGM
DCL        VAR(&SRCLIB) TYPE(*CHAR) LEN(10) VALUE(QTEMP)
DCL        VAR(&BLDLIB) TYPE(*CHAR) LEN(10) VALUE(QTEMP)
DCL        VAR(&TGTLIB) TYPE(*CHAR) LEN(10) VALUE(TESTONLY)
CRTLIB     LIB(&TGTLIB)       
MONMSG     MSGID(CPF0000) 
CRTSRCPF   FILE(&TGTLIB/QCLSRC) RCDLEN(132) 
MONMSG     MSGID(CPF0000)
CPYSRCF    FROMFILE(&SRCLIB/QCLSRC) TOFILE(&TGTLIB/QCLSRC) +
             FROMMBR(ALTROFILE) TOMBR(ALTROFILE)
ENDPGM
